app/controllers/images_controller.rb

  def create
     @image = Image.new(image_params)

     if @image.save
---
INSERT INTO "images" ("name", "file", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "image1"], ["file", "1b58ef6e3d36a42e01992accf5c52d6eea244353.jpg"], ["created_at", "2020-09-18 04:14:36.138045"], ["updated_at", "2020-09-18 04:14:36.138045"]]

  def destroy
     @image = Image.find(params[:id])
     @image.destroy
---
SELECT  "images".* FROM "images" WHERE "images"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
DELETE FROM "images" WHERE "images"."id" = ?  [["id", 1]]